{
    "entries": [
        "An elderly mage sits cross legged in the middle of the road levitating three rats. He does not speak, however, he will move to the side of the road if asked politely.",
        "A circus caravan has broken down and is under attack by 1d4 bugbears. The circus performers are actually holding their own with acrobatic attacks, fire breathing, etc.",
        "A blind woman sells beholder trinkets she whittled herself. If asked, she will tell the adventurers that she is plagued by nightmares of the creature ever since she started living in close proximity to a nearby cave.",
        "A paladin is chastising a farmer for whipping his donkey too harshly.",
        "It begins to rain blood. The party must make saving throws to avoid being frightened.",
        "You see an upside down wagon by the side of the road, 2 bodies lay close by, upon closer inspection you see hobogoblin arrows sticking out of the bodies and the cart.",
        "You see a strange green glow in the distance if it is currently night time.",
        "You find a hooded beggar at the side of the road. In actuality it is a goblin in disguise.",
        "You get attacked by birds, regular birds. It is as if magic drove them to it.",
        "A merchant's cart broke down by the side of the road.",
        "Birds all around you begin to sing and tweet in a pretty yet creepy tune, and follow the players for 1 hour, if any player tries to touch, grab or interrupt the song in anyway even by singing louder. The birds erupt into feathers and become 1d8 large screeching harpies and descend on the party",
        "There is an odd box in the middle of the road, crudely made of dark wood. When you pry it open, a small stone blade shoots up out of the box and 1d6 kobolds charge out of the woods towards you",
        "You spot a small twinkle on the floor, its a small copper coin with odd markings you don't recognise on both sides; Its extremely shiny.",
        "A small old mad huddles quickly out of a bush in front of you, and hands you a small lamb and speaks quickly \"Here hold this\" Then huddles of in the opposite direction. A farmer wielding a pitchfork runs out from where the old man came, and exclaims \"OI! Give me back my prize lamb ya' dirty thief!\"",
        "A pair of soldiers stop you on the road, enquiring if you've seen the person on a wanted poster they're carrying. The person looks surprisingly similar to one of the players...",
        "A mother duck leads her ducklings across the road during busy traffic. Trailing close behind, a hungry kobold stalks them.",
        "A travelling circus approaches. Upon closer inspection, you realize the \"circus\" consists of fast and flexible zombies being led by a necromancer \"ringleader\".",
        "A farmer is selling vegetables at a roadside stand. Three young punks are giving him a hard time (throwing his vegetables into the grass, sneaking coins from his pockets, calling him names, etc.) If spoken to, the farmer reveals that the punks are actually his three sons.",
        "A large bullfrog agressively squats in the middle of the road, biting anyone who gets close. If attacked, it sprouts a pair of raven-like wings and flies away.",
        "A grumpy man sits on the side of the road angrily pulling porcupine quills from his backside.",
        "A masked highwayman jumps out in front of the party, demanding they hand over their shoes (and only their shoes).",
        "A bard strums a lute while taking a leisurely stroll. He sings a very jaunty tune about murder, rape, and devil-worship. Closer inspection reveals that his eyes have been pulled from their sockets.",
        "A strange orange cloud of smoke billows across the horizon. Locals swear it's just swamp gas, even though it smells exactly like freshly baked bread.",
        "About a dozen corpses belonging to burly orc warriors lay strewn about next to the road. A small elf child is holding a bloody kitchen knife and weeping nearby.",
        "A blink dog puppy chases a baby displacer beast in a field nearby. The two animals are actually playing with each other.",
        "A donkey drunkenly stumbles around after having eaten some very peculiar berries that grow nearby. It drops dead after a few moments.",
        "A crying baby can be heard in a nearby cave. Upon investigation, the sound seems to originate from a strange music box that emulates the last sound it has been exposed to.",
        "Six pallbearers and a few mourners march a casket in a solemn funeral procession. Someone accidentally drops the casket, which bursts open to reveal that it was full of water the whole time.",
        "Players find a piece of candy on the ground. Another piece lies a few feet away, followed by another, and another... The candy trail leads to an empty cottage covered in blood stains.",
        "People fitted with slave collars are being driven by a midget with a whip. If confronted, the \"slaves\" admit that they requested to be treated this way.",
        "The group smell heavenly food nearby. A cook ogre is making food nearby (friendly (Day)) or smell the total opposit at night and he's not friendly)",
        "A group of lovely lady's adventurer pass by if the group fail their perception check they stole X gold/item....from the group else enjoy some arguing with a group of ladies",
        "A hangman sits crosslegged on his raised platform, carefully tying nooses. He has already finished three.",
        "A levy is ahead working on maintaining the roads. The guards nod as the party passes. The prisoners glare angrily.",
        "A shooting star falls several miles ahead down the road. There is already a collection of farmers arguing over ownership by the time the party draws near to it's landing site. In the distance, you can see an entourage approaching bearing the local lord's heraldry.",
        "Along the roadside is an unmarked gravestone. Beside it is a full bottle of liquor left as an offering, and a small bunch of wildflowers.",
        "A warrior with a pack of bloodhounds at his beck and call is coming down the road with a strong sense of purpose. He asks if anyone as seen a young woman of no more than fifteen summers with hair as auburn as the autumn harvest. Upon hearing a negative, he carries on down the road disregarding any questions.",
        "Up ahead is the scene of an obvious ambush. A tree has been felled to block the path, with heavy vegetation on each side of the road that must have served for concealment. There is a broken wagon, crates, and miscellaneous goods strewn about. A dead horse and several freshly killed merchants complete the scene.",
        "There is a felled tree blocking the path ahead, with thick brush on either side that could possibly serve as concealment. Without a successful perception check, the party is ambushed by hobgoblin raiders!",
        "There is a large felled tree blocking the path ahead, with thick brush on either side of the path that could possibly serve as concealment. That is all. There is no one there.",
        "Odd old man selling magic beans on the side of the road. The man says the beans grant people amazing powers. If the PCs buy and eat a bean, it actually gives them a banal professional skill: roll a d4 1=tax accounting 2=plumbing 3=upholstery 4=Calligraphy",
        "A mated pair of roaming owlbears crosses in front of the party's path. (They growl and roar threateningly, but will continue on their way if the party backs down and/or otherwise demonstrates they're not a threat)",
        "A merchant has set up a small roadside stand where he is selling small rocks -- ordinary rocks -- to a clamoring mob of eager customers.",
        "Beside the road is a small, partially-obscured fissure in the ground which appears to open downward into some kind of subterranean cavity. (A successful Investigation or perhaps Nature check reveals that the cavity extends underneath the road, and that continuing across heedlessly could cause a cave-in)",
        "The party walks up into the scene of a battle where ghosts relive an ambush assassination. A boy sits nearby watching his father get murdered several times and is bawling his eyes out.",
        "The party sees a huge (2000 sq ft) tent close-by with lewd sounds coming from within. Several voices can be heard coming from inside. Outside stands a brutish mercenary holding a spiked club in one hand and a bag of coins in the other. No other signage is visible.",
        "Player in the lead makes either a perception check or a dex save. Failing causes them to trip over a small, heavy glass object. It has \"DO NOT OPEN\" covering it in many languages. Contained inside is an angry genie who will grant a wish in typical \"Twisting your words\" fashion. Whenever someone carrying it falls or receives heavy blunt damage, roll a d20. On 1, the item smashes.",
        "You find an arrow stuck in a tree. Wrapped around the arrow is an eloquent love letter, addressed to no one in particular. It does, however, request that you meet its author on a nearby hilltop at dusk.",
        "A full sized tree slams to the ground a yard in front of the party, from seemingly nowhere. Moments later the ground shakes as an adult Stone Giant walks out from the forest. He will apologize, explaining he was only practicing for his tribes annual sports festival... assuming he isn't instantly attacked.",
        "You find a gold coin with your face on it.",
        "Dragon seen flying in the far distance.",
        "Party of mounted soldiers rushed past the players - they seem to be in a hurry.",
        "Small river with a bridge over it. Mother and her ducklings swimming. Perception check to notice the crocodile approaching the ducks.",
        "Nilbog traveling potions seller (incase pcs decide to remove his wares from him).",
        "A woman is about to be burnt alive at the stake just outside a small village. You hear cries of \"witch\" from the crowd and cries of terror from the 'witch'.",
        "Very strong storm w/ rain, lightning and even hail. Only shelter in this highland type area is with an old and eccentric Shepard (who is actually of feywild origins). He will allow you to stay in his house if you can figure out how to get his herd of 20 sheep out of the storm.",
        "Party starts getting insulted from afar by several smoke mephits. They won't attempt to attack, but they will attempt to mislead and harass the party until they reach the next city. Could be spies?",
        "Village has been converted by a cult that seems to be to good to be true. They appear to have the power to drive back evil (including a particularly nasty group of bandits). Turns out the bandits are affiliated with the cult members, and they are actually scam artists who are tricking the villagers into giving them their valuables.",
        "A knight challenges the party to a series of contests meant to test their mettle as warriors. Something like a wrestling match with the barbarian, a drinking contest with the dwarf, a game of riddles with the wizard. The knight won't take no for an answer.",
        "A traveler that temporarily joins the party for protection (he seems quite cowardly: he is very flighty and nervous) as they travel in the same direction is actually a werewolf. The full moon is one night away, and the werewolf doesn't know that.",
        "Deep Gnomes who have never seen the surface before suddenly emerge from the ground. It appears they are refugees who are fleeing there underground city, which is under attack.",
        "An old man requests your help in catching a REALLY big fish that resides in a lake. He appears to be an old military commander, and is quite affluent.",
        "You see a bear cub. Where's its mother?",
        "A small group of semi naked knights is under attack from a rust monster.",
        "It seems someone has placed a bounty on your head, as half a dozen mercenaries are hot on your trail.",
        "A courier on horseback catches up to the party. One of the women a party member has bedded is pregnant. (There is always that one guy...)",
        "Some very odd things are going on. I suggest the paladin turns blue, and the wizard's hat jumps off his head and runs away. It seems that a wild magic sorceress is practicing in a nearby tower.",
        "What is worse than being chased by a ghoul? Being chased by many ghouls!",
        "The jelly has come to life and is bringing justice to those that ate it's kind.",
        "\"Did that scarecrow just turn its head to look at us?\" Could use an npc here and have the scarecrow be completely normal, just to fuck with the pcs.",
        "A shady looking man offers you some \"easy money\" in return for fondling the most handsome person in the party's feet.",
        "One of the party members comes down with a fever.",
        "A storyteller asks for some coin and a meal. In return he will tell you one of his tales.",
        "A dark skinned foreigner who appears to be a merchant shows you his wares: a particularly good warm beverage (coffee). He will even show you how to make it and sell you beans. The coffee can remove one level of exhaustion if drunk.",
        "A tiefling pyromaniac is burning down parts of a forest with a sadistic smile on her face. Turns out she was actually hired to do this to stop fires in the future.",
        "Hail and winds. A funnel is seen and soon touches the ground becoming a tornado, precariously close by. Perhaps the tornado is a gateway to the elemental plane of air and some nasties from that plane find their way to the prime material plane.",
        "Dust or what appears to be smoke rises in a great plume in the distance. Soon the ground shakes ominously. A stampede (thousands or more strong) of antelope, bison, caribou, etc, is seen emerging from a hillside. Tribal hunters on horseback are in the middle of a hunt.",
        "Wildfire. As the PCs continue on their long journey they notice the sky getting more and more hazy. Continuing forth they see a huge wildfire has overtaken a massive swath of land. Was it produced by lightning in a parched land, or something more nefarious? Perhaps this fire somehow opens a nexus between the elemental plane of fire and prime material plane.",
        "A young boy helps an old decrepit lady along. Dressed in foreign looking clothing they are lost and ask for help finding their caravan after a bad situation split them up. If/when the PCs assist, they're rewarded with mad street cred with a group of gypsies. Good food, song, dance, sex may be had at the gypsy camp. The old woman is a highly regarded prophet who gives the PCs a tarot reading before she allows them to leave camp.",
        "A huge tree at a crossroads has dozens of hanged victims dangling from its branches. Some are fresh with bags over their heads, some are skeletal. Bones and refuse litter the area around the tree and the smell of death is strong. If there's a trail the PCs follow, it conspicuously skirts around this area. Locals don't want to talk about it.",
        "A ghostly and solemn procession of 11 mounted humanoids travels slowly down the road in the opposite direction. They carry lances and spears with pennons that flutter in a breeze you cannot feel. Some of the party perceive them as being dressed all in black, the rest all in white. To all but one of the party they are perfectly silent, to that one they all are chanting a wordless dirge.",
        "Suddenly a shadow blocks the sun. Looking up a huge amorphous shape float downward rapidly and gets stuck on a high tree, revealing itself to be a huge empty fabric bag. From the bag hangs a small basket, and inside is a small unknown humanoid creature shouting in an unknown language.",
        "Some sort of large mechanical automaton is rolling a 10 foot high wheel of stone down the road. If you get it's attention it will make as if to speak but only scratching and squeezing noises emerge.",
        "A small gnome child runs toward the party crying, and looking frightened. Within seconds a burly, breathless half-orc comes into view, if allowed to catch his breath he will claim the child stole his purse. The child will deny it, and plead for protection, but if successfully searched will possess a purse identical to the half orc's description ( if they ams him for one).",
        "As you travel along the road, you come across a satyr carrying several stone tablets, looking at them very intently. He's so distracted that he doesn't even notice you approach. When he finally realizes he's not alone he jumps in fright, drops the stone tablets on the ground and runs away. On the tablets are crudely drawn pornographic images.",
        "You approach a small shrine to Fharlanghn aside the trail. There is 1d4 days of fresh food and water and a few trinkets. A sign by the altar offers free aid to travelers in need, and asks those with extra provisions to spare to pay it forward.",
        "You meet a travelling priest on the road; he greets you and offers a blessing to make your travels easier. You feel refreshed and can easily walk a 1d4 extra miles today.",
        "The party hears/feels a deep rumble underneath the earth directly below them.",
        "Dozens of birds suddenly appear flying in the same direction. Over time more animals cross the path moving in the same direction as the birds. Deer, wild ponies, squirrels, snakes, rabbits etc. It is almost as though they are moving away from something.",
        "Two young lovers sit under a tree, feeding each other bits of fruit and cheese. A bottle of wine sits next to them.",
        "A small group of children run past, laughing and tossing a ball between them.",
        "A family on a pilgrimage passes by. They each bow politely and wish their god(dess)'s blessings upon you.",
        "A wizard is standing in the middle of a field behind a large pile of dirt and making complicated gestures at a straw dummy set some twenty feet away. An nervous (and slightly scorched) apprentice stands behind him, holding several components.",
        "A saddled horse, with no rider, runs past you.",
        "A village is having a massive harvest festival/faire, but it seems a nearby nest of Giant Ants (as in Large sized Ants) has invade and is carrying away the food, livestock, and kegs of sweet mead.",
        "A flying carpet roars past overhead, being chased by a angry dragon. The people on the back of the carpet are tossing gold and jewels over the side, hoping to lighten the load.",
        "Several apprentices are arguing over who's master is the best. One of them sees the party and shouts for them to settle the matter. They each present an example of their master's work for inspection.",
        "A bored looking young woman (or man) observes two bards, arguing with each other over her (or his) affections. Both have written songs and will not allow the other to go first.",
        "An angry dog sits under a tree, glaring up into the branches. He has a piece of cloth in his mouth. In the tree a disheveled person looks back at the dog, making shooing motions. Nearby several sheep graze, one of which has a lasso about it's neck.",
        "The party sees an ogre carrying an ornate broadsword. If attacked, the ogre will only defend itself and not attempt to harm the adventurers in any way. If they speak to him, he will introduce himself as Garg and will introduce his sword Moonslicer as well. He will indicate that he is looking to \"Do good.\""
    ]
}